id: 1dfb8a4c-a42f-41f7-8009-3cd9075187bb
name: Example query with all possible settings - NRT
version: 1.0.0
kind: NRT
description: This is used as a validation example for SentinelARConverter - NRT rule
severity: Informational
tactics:
- CommandAndControl
- InhibitResponseFunction
- ImpairProcessControl
relevantTechniques:
- T1090
- T1001
- T0805
- T0856
query: |-
  AADNonInteractiveUserSignInLogs
  | where false
suppressionDuration: 1d
suppressionEnabled: true
eventGroupingSettings:
  aggregationKind: SingleAlert
alertDetailsOverride:
  alertDisplayNameFormat: 'Example alert {{ProcessingTimeInMs}}  '
  alertDescriptionFormat: 'Do not run this in you environment because the answer is {{ResultType}} '
  alertDynamicProperties:
  - alertProperty: ProductName
    value: SourceSystem
customDetails:
  ResultDesc: ResultDescription
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: UserId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPAddress
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: true
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []

